Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCPDT.svd
        <register>
          <name>SYNC</name>
          <description>GPTM Synchronize</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>TIMER_SYNC_SYNCT0</name>
              <description>Synchronize GPTM Timer 0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_NONE</name>
                  <description>GPTM0 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TA</name>
                  <description>A timeout event for Timer A of GPTM0 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TB</name>
                  <description>A timeout event for Timer B of GPTM0 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT0_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM0 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT1</name>
              <description>Synchronize GPTM Timer 1</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_NONE</name>
                  <description>GPTM1 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TA</name>
                  <description>A timeout event for Timer A of GPTM1 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TB</name>
                  <description>A timeout event for Timer B of GPTM1 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT1_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM1 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT2</name>
              <description>Synchronize GPTM Timer 2</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_NONE</name>
                  <description>GPTM2 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TA</name>
                  <description>A timeout event for Timer A of GPTM2 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TB</name>
                  <description>A timeout event for Timer B of GPTM2 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT2_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM2 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT3</name>
              <description>Synchronize GPTM Timer 3</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_NONE</name>
                  <description>GPTM3 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TA</name>
                  <description>A timeout event for Timer A of GPTM3 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TB</name>
                  <description>A timeout event for Timer B of GPTM3 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT3_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM3 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT4</name>
              <description>Synchronize GPTM Timer 4</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_NONE</name>
                  <description>GPTM4 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TA</name>
                  <description>A timeout event for Timer A of GPTM4 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TB</name>
                  <description>A timeout event for Timer B of GPTM4 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT4_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM4 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT5</name>
              <description>Synchronize GPTM Timer 5</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_NONE</name>
                  <description>GPTM5 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TA</name>
                  <description>A timeout event for Timer A of GPTM5 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TB</name>
                  <description>A timeout event for Timer B of GPTM5 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT5_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM5 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT6</name>
              <description>Synchronize GPTM Timer 6</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_NONE</name>
                  <description>GPTM6 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_TA</name>
                  <description>A timeout event for Timer A of GPTM6 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_TB</name>
                  <description>A timeout event for Timer B of GPTM6 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT6_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM6 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_SYNC_SYNCT7</name>
              <description>Synchronize GPTM Timer 7</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_NONE</name>
                  <description>GPT7 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_TA</name>
                  <description>A timeout event for Timer A of GPTM7 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_TB</name>
                  <description>A timeout event for Timer B of GPTM7 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_SYNC_SYNCT7_TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM7 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>TIMER_IMR_TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CAMIM</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CAEIM</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_RTCIM</name>
              <description>GPTM RTC Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TAMIM</name>
              <description>GPTM Timer A Match Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_DMAAIM</name>
              <description>GPTM Timer A DMA Done Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CBMIM</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_CBEIM</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TBMIM</name>
              <description>GPTM Timer B Match Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_DMABIM</name>
              <description>GPTM Timer B DMA Done Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>GPTM Raw Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>TIMER_RIS_TATORIS</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CAMRIS</name>
              <description>GPTM Timer A Capture Mode Match Raw Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CAERIS</name>
              <description>GPTM Timer A Capture Mode Event Raw Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_RTCRIS</name>
              <description>GPTM RTC Raw Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TAMRIS</name>
              <description>GPTM Timer A Match Raw Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_DMAARIS</name>
              <description>GPTM Timer A DMA Done Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TBTORIS</name>
              <description>GPTM Timer B Time-Out Raw Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CBMRIS</name>
              <description>GPTM Timer B Capture Mode Match Raw Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_CBERIS</name>
              <description>GPTM Timer B Capture Mode Event Raw Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TBMRIS</name>
              <description>GPTM Timer B Match Raw Interrupt</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_DMABRIS</name>
              <description>GPTM Timer B DMA Done Raw Interrupt Status</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>GPTM Masked Interrupt Status</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>TIMER_MIS_TATOMIS</name>
              <description>GPTM Timer A Time-Out Masked Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CAMMIS</name>
              <description>GPTM Timer A Capture Mode Match Masked Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CAEMIS</name>
              <description>GPTM Timer A Capture Mode Event Masked Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_RTCMIS</name>
              <description>GPTM RTC Masked Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TAMMIS</name>
              <description>GPTM Timer A Match Masked Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_DMAAMIS</name>
              <description>GPTM Timer A DMA Done Masked Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TBTOMIS</name>
              <description>GPTM Timer B Time-Out Masked Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CBMMIS</name>
              <description>GPTM Timer B Capture Mode Match Masked Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_CBEMIS</name>
              <description>GPTM Timer B Capture Mode Event Masked Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TBMMIS</name>
              <description>GPTM Timer B Match Masked Interrupt</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_DMABMIS</name>
              <description>GPTM Timer B DMA Done Masked Interrupt</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>GPTM Interrupt Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TIMER_ICR_TATOCINT</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAMCINT</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CAECINT</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_RTCCINT</name>
              <description>GPTM RTC Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TAMCINT</name>
              <description>GPTM Timer A Match Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_DMAAINT</name>
              <description>GPTM Timer A DMA Done Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBTOCINT</name>
              <description>GPTM Timer B Time-Out Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBMCINT</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_CBECINT</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBMCINT</name>
              <description>GPTM Timer B Match Interrupt Clear</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_DMABINT</name>
              <description>GPTM Timer B DMA Done Interrupt Clear</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAILR</name>
          <description>GPTM Timer A Interval Load</description>
          <addressOffset>0x00000028</addressOffset>
        </register>
        <register>
          <name>TBILR</name>
          <description>GPTM Timer B Interval Load</description>
          <addressOffset>0x0000002C</addressOffset>
        </register>
        <register>
          <name>TAMATCHR</name>
          <description>GPTM Timer A Match</description>
          <addressOffset>0x00000030</addressOffset>
        </register>
        <register>
          <name>TBMATCHR</name>
          <description>GPTM Timer B Match</description>
          <addressOffset>0x00000034</addressOffset>
        </register>
        <register>
          <name>TAPR</name>
          <description>GPTM Timer A Prescale</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPR_TAPSR</name>
              <description>GPTM Timer A Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <description>GPTM Timer B Prescale</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPR_TBPSR</name>
              <description>GPTM Timer B Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPMR</name>
          <description>GPTM TimerA Prescale Match</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPMR_TAPSMR</name>
              <description>GPTM TimerA Prescale Match</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPMR</name>
          <description>GPTM TimerB Prescale Match</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPMR_TBPSMR</name>
              <description>GPTM TimerB Prescale Match</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>GPTM Timer A</description>
          <addressOffset>0x00000048</addressOffset>
        </register>
        <register>
          <name>TBR</name>
          <description>GPTM Timer B</description>
          <addressOffset>0x0000004C</addressOffset>
        </register>
        <register>
          <name>TAV</name>
          <description>GPTM Timer A Value</description>
          <addressOffset>0x00000050</addressOffset>
        </register>
        <register>
          <name>TBV</name>
          <description>GPTM Timer B Value</description>
          <addressOffset>0x00000054</addressOffset>
        </register>
