Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCPDT.svd
        <register>
          <name>RXHUBPORT4</name>
          <description>USB Receive Hub Port Endpoint 4</description>
          <addressOffset>0x000000A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR5</name>
          <description>USB Transmit Functional Address Endpoint 5</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR5</name>
          <description>USB Transmit Hub Address Endpoint 5</description>
          <addressOffset>0x000000AA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT5</name>
          <description>USB Transmit Hub Port Endpoint 5</description>
          <addressOffset>0x000000AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR5</name>
          <description>USB Receive Functional Address Endpoint 5</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR5</name>
          <description>USB Receive Hub Address Endpoint 5</description>
          <addressOffset>0x000000AE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT5</name>
          <description>USB Receive Hub Port Endpoint 5</description>
          <addressOffset>0x000000AF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR6</name>
          <description>USB Transmit Functional Address Endpoint 6</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR6</name>
          <description>USB Transmit Hub Address Endpoint 6</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT6</name>
          <description>USB Transmit Hub Port Endpoint 6</description>
          <addressOffset>0x000000B3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT6_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR6</name>
          <description>USB Receive Functional Address Endpoint 6</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR6</name>
          <description>USB Receive Hub Address Endpoint 6</description>
          <addressOffset>0x000000B6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT6</name>
          <description>USB Receive Hub Port Endpoint 6</description>
          <addressOffset>0x000000B7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT6_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR7</name>
          <description>USB Transmit Functional Address Endpoint 7</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR7_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR7</name>
          <description>USB Transmit Hub Address Endpoint 7</description>
          <addressOffset>0x000000BA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR7_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT7</name>
          <description>USB Transmit Hub Port Endpoint 7</description>
          <addressOffset>0x000000BB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT7_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR7</name>
          <description>USB Receive Functional Address Endpoint 7</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR7_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR7</name>
          <description>USB Receive Hub Address Endpoint 7</description>
          <addressOffset>0x000000BE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR7_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT7</name>
          <description>USB Receive Hub Port Endpoint 7</description>
          <addressOffset>0x000000BF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT7_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_DATAEND</name>
              <description>Data End</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETEND</name>
              <description>Setup End</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALL</name>
              <description>Send Stall</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_RXRDYC</name>
              <description>RXRDY Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETENDC</name>
              <description>Setup End Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_ERROR</name>
              <description>Error</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STATUS</name>
              <description>STATUS Packet</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRH0</name>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRH0_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DISPING</name>
              <description>PING Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT0</name>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_COUNT0_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TYPE0</name>
          <description>USB Type Endpoint 0</description>
          <addressOffset>0x0000010A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TYPE0_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_HIGH</name>
                  <description>High</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NAKLMT</name>
          <description>USB NAK Limit</description>
          <addressOffset>0x0000010B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_NAKLMT_NAKLMT</name>
              <description>EP0 NAK Limit</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP1</name>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH1</name>
          <description>USB Transmit Control and Status Endpoint 1 High</description>
          <addressOffset>0x00000113</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH1_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP1</name>
          <description>USB Maximum Receive Data Endpoint 1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL1</name>
          <description>USB Receive Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000116</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL1_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL1</name>
          <description>USB Receive Control and Status Endpoint 1 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000116</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL1_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
