Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCPDT.svd
        <register>
          <name>TPSTAT</name>
          <description>HIB Tamper Status</description>
          <addressOffset>0x00000404</addressOffset>
          <fields>
            <field>
              <name>HIB_TPSTAT_XOSCFAIL</name>
              <description>External Oscillator Failure</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPSTAT_XOSCST</name>
              <description>External Oscillator Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_TPSTAT_STATE</name>
              <description>Tamper Module Status</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_TPSTAT_STATE_DISABLED</name>
                  <description>Tamper disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPSTAT_STATE_CONFIGED</name>
                  <description>Tamper configured</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPSTAT_STATE_ERROR</name>
                  <description>Tamper pin event occurred</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPIO</name>
          <description>HIB Tamper I/O Control</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>HIB_TPIO_EN0</name>
              <description>TMPR0 Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_LEV0</name>
              <description>TMPR0 Trigger Level</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_PUEN0</name>
              <description>TMPR0 Internal Weak Pull-up Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR0</name>
              <description>TMPR0 Glitch Filtering</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_EN1</name>
              <description>TMPR1Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_LEV1</name>
              <description>TMPR1 Trigger Level</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_PUEN1</name>
              <description>TMPR1 Internal Weak Pull-up Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR1</name>
              <description>TMPR1 Glitch Filtering</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_EN2</name>
              <description>TMPR2 Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_LEV2</name>
              <description>TMPR2 Trigger Level</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_PUEN2</name>
              <description>TMPR2 Internal Weak Pull-up Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR2</name>
              <description>TMPR2 Glitch Filtering</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_EN3</name>
              <description>TMPR3 Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_LEV3</name>
              <description>TMPR3 Trigger Level</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_PUEN3</name>
              <description>TMPR3 Internal Weak Pull-up Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>HIB_TPIO_GFLTR3</name>
              <description>TMPR3 Glitch Filtering</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG0</name>
          <description>HIB Tamper Log 0</description>
          <addressOffset>0x000004E0</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG0_TIME</name>
              <description>Tamper Log Calendar Information</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG1</name>
          <description>HIB Tamper Log 1</description>
          <addressOffset>0x000004E4</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG1_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG1_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG1_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG1_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG1_XOSC</name>
              <description>Status of external 32</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG2</name>
          <description>HIB Tamper Log 2</description>
          <addressOffset>0x000004E8</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG2_TIME</name>
              <description>Tamper Log Calendar Information</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG3</name>
          <description>HIB Tamper Log 3</description>
          <addressOffset>0x000004EC</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG3_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG3_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG3_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG3_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG3_XOSC</name>
              <description>Status of external 32</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG4</name>
          <description>HIB Tamper Log 4</description>
          <addressOffset>0x000004F0</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG4_TIME</name>
              <description>Tamper Log Calendar Information</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG5</name>
          <description>HIB Tamper Log 5</description>
          <addressOffset>0x000004F4</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG5_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG5_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG5_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG5_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG5_XOSC</name>
              <description>Status of external 32</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG6</name>
          <description>HIB Tamper Log 6</description>
          <addressOffset>0x000004F8</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG6_TIME</name>
              <description>Tamper Log Calendar Information</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG7</name>
          <description>HIB Tamper Log 7</description>
          <addressOffset>0x000004FC</addressOffset>
          <fields>
            <field>
              <name>HIB_TPLOG7_TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG7_TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG7_TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG7_TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_TPLOG7_XOSC</name>
              <description>Status of external 32</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>Hibernation Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>HIB_PP_WAKENC</name>
              <description>Wake Pin Presence</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_PP_TAMPER</name>
              <description>Tamper Pin Presence</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>Hibernation Clock Control</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>HIB_CC_SYSCLKEN</name>
              <description>RTCOSC to System Clock Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
