Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCPDT.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>Register map for FLASH_CTRL peripheral</description>
      <groupName>FLASH_CTRL</groupName>
      <prependToName>FLASH_CTRL</prependToName>
      <baseAddress>0x400FD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>FLASH_CTRL</name><value>29</value></interrupt>
      <registers>
        <register>
          <name>FMA</name>
          <description>Flash Memory Address</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMA_OFFSET</name>
              <description>Address Offset</description>
              <bitRange>[19:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMD</name>
          <description>Flash Memory Data</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMD_DATA</name>
              <description>Data Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC</name>
          <description>Flash Memory Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMC_WRITE</name>
              <description>Write a Word into Flash Memory</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_ERASE</name>
              <description>Erase a Page of Flash Memory</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_MERASE</name>
              <description>Mass Erase Flash Memory</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_COMT</name>
              <description>Commit Register Value</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_WRKEY</name>
              <description>FLASH write key</description>
              <bitRange>[31:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCRIS</name>
          <description>Flash Controller Raw Interrupt Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCRIS_ARIS</name>
              <description>Access Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_PRIS</name>
              <description>Programming Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_ERIS</name>
              <description>EEPROM Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_VOLTRIS</name>
              <description>Pump Voltage Raw Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_INVDRIS</name>
              <description>Invalid Data Raw Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_ERRIS</name>
              <description>Erase Verify Error Raw Interrupt Status</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_PROGRIS</name>
              <description>Program Verify Error Raw Interrupt Status</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCIM</name>
          <description>Flash Controller Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCIM_AMASK</name>
              <description>Access Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_PMASK</name>
              <description>Programming Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_EMASK</name>
              <description>EEPROM Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_VOLTMASK</name>
              <description>VOLT Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_INVDMASK</name>
              <description>Invalid Data Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_ERMASK</name>
              <description>ERVER Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_PROGMASK</name>
              <description>PROGVER Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCMISC</name>
          <description>Flash Controller Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCMISC_AMISC</name>
              <description>Access Masked Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_PMISC</name>
              <description>Programming Masked Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_EMISC</name>
              <description>EEPROM Masked Interrupt Status and Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_VOLTMISC</name>
              <description>VOLT Masked Interrupt Status and Clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_INVDMISC</name>
              <description>Invalid Data Masked Interrupt Status and Clear</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_ERMISC</name>
              <description>ERVER Masked Interrupt Status and Clear</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_PROGMISC</name>
              <description>PROGVER Masked Interrupt Status and Clear</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC2</name>
          <description>Flash Memory Control 2</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMC2_WRBUF</name>
              <description>Buffered Flash Memory Write</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBVAL</name>
          <description>Flash Write Buffer Valid</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>FLASH_FWBVAL_FWB</name>
              <description>Flash Memory Write Buffer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLPEKEY</name>
          <description>Flash Program/Erase Key</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>FLASH_FLPEKEY_PEKEY</name>
              <description>Key Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBN</name>
          <description>Flash Write Buffer n</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>FLASH_FWBN_DATA</name>
              <description>Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>Flash Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>FLASH_PP_SIZE</name>
              <description>Flash Size</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_PP_SIZE_1MB</name>
                  <description>1024 KB of Flash</description>
                  <value>0x1ff</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PP_MAINSS</name>
              <description>Flash Sector Size of the physical bank</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_1KB</name>
                  <description>1 KB</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_2KB</name>
                  <description>2 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_4KB</name>
                  <description>4 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_8KB</name>
                  <description>8 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_MAINSS_16KB</name>
                  <description>16 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PP_EESS</name>
              <description>EEPROM Sector Size of the physical bank</description>
              <bitRange>[22:19]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_1KB</name>
                  <description>1 KB</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_2KB</name>
                  <description>2 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_4KB</name>
                  <description>4 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_PP_EESS_8KB</name>
                  <description>8 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_PP_DFA</name>
              <description>DMA Flash Access</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FLASH_PP_FMM</name>
              <description>Flash Mirror Mode</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FLASH_PP_PFC</name>
              <description>Prefetch Buffer Mode</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIZE</name>
          <description>SRAM Size</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>FLASH_SSIZE_SIZE</name>
              <description>SRAM Size</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_SSIZE_SIZE_256KB</name>
                  <description>256 KB of SRAM</description>
                  <value>0x3ff</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>Flash Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>FLASH_CONF_FPFOFF</name>
              <description>Force Prefetch Off</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FLASH_CONF_FPFON</name>
              <description>Force Prefetch On</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>FLASH_CONF_CLRTV</name>
              <description>Clear Valid Tags</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>FLASH_CONF_SPFE</name>
              <description>Single Prefetch Mode Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FLASH_CONF_FMME</name>
              <description>Flash Mirror Mode Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMSWMAP</name>
          <description>ROM Software Map</description>
          <addressOffset>0x00000FCC</addressOffset>
          <fields>
            <field>
              <name>FLASH_ROMSWMAP_SW0EN</name>
              <description>ROM SW Region 0 Availability</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW0EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW0EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW1EN</name>
              <description>ROM SW Region 1 Availability</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW1EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW1EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW2EN</name>
              <description>ROM SW Region 2 Availability</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW2EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW2EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW3EN</name>
              <description>ROM SW Region 3 Availability</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW3EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW3EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW4EN</name>
              <description>ROM SW Region 4 Availability</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW4EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW4EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW5EN</name>
              <description>ROM SW Region 5 Availability</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW5EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW5EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW6EN</name>
              <description>ROM SW Region 6 Availability</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW6EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW6EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_ROMSWMAP_SW7EN</name>
              <description>ROM SW Region 7 Availability</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW7EN_NOTVIS</name>
                  <description>Software region not available to the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_ROMSWMAP_SW7EN_CORE</name>
                  <description>Region available to core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASZ</name>
          <description>Flash DMA Address Size</description>
          <addressOffset>0x00000FD0</addressOffset>
          <fields>
            <field>
              <name>FLASH_DMASZ_SIZE</name>
              <description>uDMA-accessible Memory Size</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAST</name>
          <description>Flash DMA Starting Address</description>
          <addressOffset>0x00000FD4</addressOffset>
          <fields>
            <field>
              <name>FLASH_DMAST_ADDR</name>
              <description>Contains the starting address of the flash region accessible by uDMA if the FLASHPP register DFA bit is set</description>
              <bitRange>[28:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RVP</name>
          <description>Reset Vector Pointer</description>
          <addressOffset>0x000010D4</addressOffset>
          <fields>
            <field>
              <name>FLASH_RVP_RV</name>
              <description>Reset Vector Pointer Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
