Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCPDT.svd
        <register>
          <name>LDODPCTL</name>
          <description>LDO Deep-Sleep Power Control</description>
          <addressOffset>0x000001BC</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDODPCTL_VLDO</name>
              <description>LDO Output Voltage</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_0_90V</name>
                  <description>0.90 V</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_0_95V</name>
                  <description>0.95 V</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_00V</name>
                  <description>1.00 V</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_05V</name>
                  <description>1.05 V</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_10V</name>
                  <description>1.10 V</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_15V</name>
                  <description>1.15 V</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_20V</name>
                  <description>1.20 V</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_25V</name>
                  <description>1.25 V</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_30V</name>
                  <description>1.30 V</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDODPCTL_VLDO_1_35V</name>
                  <description>1.35 V</description>
                  <value>0x1b</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_LDODPCTL_VADJEN</name>
              <description>Voltage Adjust Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESBEHAVCTL</name>
          <description>Reset Behavior Control Register</description>
          <addressOffset>0x000001D8</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RESBEHAVCTL_EXTRES</name>
              <description>External RST Pin Operation</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_EXTRES_SYSRST</name>
                  <description>External RST assertion issues a system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_EXTRES_POR</name>
                  <description>External RST assertion issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RESBEHAVCTL_BOR</name>
              <description>BOR Reset operation</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_BOR_SYSRST</name>
                  <description>Brown Out Reset issues system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_BOR_POR</name>
                  <description>Brown Out Reset issues a simulated POR sequence. The application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RESBEHAVCTL_WDOG0</name>
              <description>Watchdog 0 Reset Operation</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG0_SYSRST</name>
                  <description>Watchdog 0 issues a system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG0_POR</name>
                  <description>Watchdog 0 issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RESBEHAVCTL_WDOG1</name>
              <description>Watchdog 1 Reset Operation</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG1_SYSRST</name>
                  <description>Watchdog 1 issues a system reset. The application starts within 10 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RESBEHAVCTL_WDOG1_POR</name>
                  <description>Watchdog 1 issues a simulated POR sequence. Application starts less than 500 us after deassertion (Default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSSR</name>
          <description>Hardware System Service Request</description>
          <addressOffset>0x000001F4</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_HSSR_CDOFF</name>
              <description>Command Descriptor Pointer</description>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_HSSR_KEY</name>
              <description>Write Key</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPDS</name>
          <description>USB Power Domain Status</description>
          <addressOffset>0x00000280</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_USBPDS_PWRSTAT</name>
              <description>Power Domain Status</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_PWRSTAT_OFF</name>
                  <description>OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_PWRSTAT_ON</name>
                  <description>ON</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_USBPDS_MEMSTAT</name>
              <description>Memory Array Power Status</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_MEMSTAT_OFF</name>
                  <description>Array OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_MEMSTAT_RETAIN</name>
                  <description>SRAM Retention</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBPDS_MEMSTAT_ON</name>
                  <description>Array On</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBMPC</name>
          <description>USB Memory Power Control</description>
          <addressOffset>0x00000284</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_USBMPC_PWRCTL</name>
              <description>Memory Array Power Control</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_USBMPC_PWRCTL_OFF</name>
                  <description>Array OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBMPC_PWRCTL_RETAIN</name>
                  <description>SRAM Retention</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_USBMPC_PWRCTL_ON</name>
                  <description>Array On</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWD</name>
          <description>Watchdog Timer Peripheral Present</description>
          <addressOffset>0x00000300</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPWD_P0</name>
              <description>Watchdog Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWD_P1</name>
              <description>Watchdog Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPTIMER</name>
          <description>16/32-Bit General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x00000304</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPTIMER_P0</name>
              <description>16/32-Bit General-Purpose Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P1</name>
              <description>16/32-Bit General-Purpose Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P2</name>
              <description>16/32-Bit General-Purpose Timer 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P3</name>
              <description>16/32-Bit General-Purpose Timer 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P4</name>
              <description>16/32-Bit General-Purpose Timer 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P5</name>
              <description>16/32-Bit General-Purpose Timer 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P6</name>
              <description>16/32-Bit General-Purpose Timer 6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPTIMER_P7</name>
              <description>16/32-Bit General-Purpose Timer 7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPGPIO</name>
          <description>General-Purpose Input/Output Peripheral Present</description>
          <addressOffset>0x00000308</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPGPIO_P0</name>
              <description>GPIO Port A Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P1</name>
              <description>GPIO Port B Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P2</name>
              <description>GPIO Port C Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P3</name>
              <description>GPIO Port D Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P4</name>
              <description>GPIO Port E Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P5</name>
              <description>GPIO Port F Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P6</name>
              <description>GPIO Port G Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P7</name>
              <description>GPIO Port H Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P8</name>
              <description>GPIO Port J Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P9</name>
              <description>GPIO Port K Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P10</name>
              <description>GPIO Port L Present</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P11</name>
              <description>GPIO Port M Present</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P12</name>
              <description>GPIO Port N Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P13</name>
              <description>GPIO Port P Present</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPGPIO_P14</name>
              <description>GPIO Port Q Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPDMA</name>
          <description>Micro Direct Memory Access Peripheral Present</description>
          <addressOffset>0x0000030C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPDMA_P0</name>
              <description>uDMA Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPEPI</name>
          <description>EPI Peripheral Present</description>
          <addressOffset>0x00000310</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPEPI_P0</name>
              <description>EPI Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPHIB</name>
          <description>Hibernation Peripheral Present</description>
          <addressOffset>0x00000314</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPHIB_P0</name>
              <description>Hibernation Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Present</description>
          <addressOffset>0x00000318</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPUART_P0</name>
              <description>UART Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P1</name>
              <description>UART Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P2</name>
              <description>UART Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P3</name>
              <description>UART Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P4</name>
              <description>UART Module 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P5</name>
              <description>UART Module 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P6</name>
              <description>UART Module 6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPUART_P7</name>
              <description>UART Module 7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSSI</name>
          <description>Synchronous Serial Interface Peripheral Present</description>
          <addressOffset>0x0000031C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPSSI_P0</name>
              <description>SSI Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P1</name>
              <description>SSI Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P2</name>
              <description>SSI Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPSSI_P3</name>
              <description>SSI Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPI2C</name>
          <description>Inter-Integrated Circuit Peripheral Present</description>
          <addressOffset>0x00000320</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPI2C_P0</name>
              <description>I2C Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P1</name>
              <description>I2C Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P2</name>
              <description>I2C Module 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P3</name>
              <description>I2C Module 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P4</name>
              <description>I2C Module 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P5</name>
              <description>I2C Module 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P6</name>
              <description>I2C Module 6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P7</name>
              <description>I2C Module 7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P8</name>
              <description>I2C Module 8 Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPI2C_P9</name>
              <description>I2C Module 9 Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUSB</name>
          <description>Universal Serial Bus Peripheral Present</description>
          <addressOffset>0x00000328</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPUSB_P0</name>
              <description>USB Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPEPHY</name>
          <description>Ethernet PHY Peripheral Present</description>
          <addressOffset>0x00000330</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPEPHY_P0</name>
              <description>Ethernet PHY Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCAN</name>
          <description>Controller Area Network Peripheral Present</description>
          <addressOffset>0x00000334</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPCAN_P0</name>
              <description>CAN Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPCAN_P1</name>
              <description>CAN Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPADC</name>
          <description>Analog-to-Digital Converter Peripheral Present</description>
          <addressOffset>0x00000338</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPADC_P0</name>
              <description>ADC Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPADC_P1</name>
              <description>ADC Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
